Repository: FeretUI/feretui
Catalog: feretui/locale/*.po
Languages: fr

# form:feretui.form:FeretUIForm
source: Not a valid integer value.
fr: N'est pas un entier valide.

# form:feretui.form:FeretUIForm
source: Not a valid decimal value.
fr: N'est pas un nombre valide.

# form:feretui.form:FeretUIForm
source: Not a valid float value.
fr: N'est pas un nombre valide.

# form:feretui.form:FeretUIForm
source: Not a valid datetime value.
fr: N'est pas une date / heure valide.

# form:feretui.form:FeretUIForm
source: Not a valid date value.
fr: N'est pas une date valide.

# form:feretui.form:FeretUIForm
source: Not a valid time value.
fr: N'est pas une heure valide.

# form:feretui.form:FeretUIForm
source: Not a valid week value.
fr: N'est pas une semaine valide.

# form:feretui.form:FeretUIForm
source: Invalid Choice: could not coerce.
fr: Choix invalide.

# form:feretui.form:FeretUIForm
source: Choices cannot be None.
fr: La liste des choix ne peut être vide.

# form:feretui.form:FeretUIForm
source: Not a valid choice.
fr: N'est pas une choix valide.

# form:feretui.form:FeretUIForm
source: Invalid choice(s): one or more data inputs could not be coerced.
fr: Choix invalide(s) : une ou plusieurs entrées de données n'ont pas pu être forcées.

# form:feretui.form:FeretUIForm
source: '%(value)s' is not a valid choice for this field.
fr: '%(value)s' n'est pas un choix valide pour ce champ.

# form:feretui.form:FeretUIForm
source: '%(value)s' are not valid choices for this field.
fr: '%(value)s' ne sont pas des choix valides pour ce champ.

# form:feretui.form:FeretUIForm
source: Invalid CSRF Token.
fr: Jeton CSRF invalide.

# form:feretui.form:FeretUIForm
source: CSRF token missing.
fr: Jeton CSRF manquant.

# form:feretui.form:FeretUIForm
source: CSRF failed.
fr: CSRF a échoué.

# form:feretui.form:FeretUIForm
source: CSRF token expired.
fr: Le jeton CSRF a expiré.

# form:feretui.form:FeretUIForm
source: Invalid field name '%s'.
fr: Nom de champ '%s' non valide.

# form:feretui.form:FeretUIForm
source: Field must be equal to %(other_name)s.
fr: Le champs doit être égale à %(other_name)s.

# form:feretui.form:FeretUIForm
source: Field must be at least %(min)d character long.
fr: Le champ doit contenir au moins %(min)d caractères.

# form:feretui.form:FeretUIForm
source: Field must be at least %(min)d characters long.
fr: Le champ doit contenir au moins %(min)d caractères.

# form:feretui.form:FeretUIForm
source: Field cannot be longer than %(max)d character.
fr: Le champ ne peut pas contenir plus de %(max)d caractères.

# form:feretui.form:FeretUIForm
source: Field cannot be longer than %(max)d characters.
fr: Le champ ne peut pas contenir plus de %(max)d caractères.

# form:feretui.form:FeretUIForm
source: Field must be exactly %(max)d character long.
fr: Le champ doit contenir exactement %(max)d caractères.

# form:feretui.form:FeretUIForm
source: Field must be exactly %(max)d characters long.
fr: Le champ doit contenir exactement %(max)d caractères.

# form:feretui.form:FeretUIForm
source: Field must be between %(min)d and %(max)d characters long.
fr: Le champ doit contenir entre %(min)d et %(max)d caractères.

# form:feretui.form:FeretUIForm
source: Number must be at least %(min)s.
fr: Le nombre doit être d'au moins %(min)s.

# form:feretui.form:FeretUIForm
source: Number must be at most %(max)s.
fr: Le nombre doit être au plus %(max)s.

# form:feretui.form:FeretUIForm
source: Number must be between %(min)s and %(max)s.
fr: Le nombre doit être compris entre %(min)s et %(max)s.

# form:feretui.form:FeretUIForm
source: This field is required.
fr: Ce champ est obligatoire.

# form:feretui.form:FeretUIForm
source: Invalid input.
fr: Entrée invalide.

# form:feretui.form:FeretUIForm
source: Invalid email address.
fr: Adresse e-mail invalide.

# form:feretui.form:FeretUIForm
source: Invalid IP address.
fr: Adresse IP invalide.

# form:feretui.form:FeretUIForm
source: Invalid Mac address.
fr: Adresse Mac invalide.

# form:feretui.form:FeretUIForm
source: Invalid URL.
fr: URL invalide.

# form:feretui.form:FeretUIForm
source: Invalid UUID.
fr: UUID non valide.

# form:feretui.form:FeretUIForm
source: Invalid value, must be one of: %(values)s.
fr: Valeur non valide, doit être l'une des suivantes : %(values)s.

# form:feretui.form:FeretUIForm
source: Invalid value, can't be any of: %(values)s.
fr: Valeur non valide. Il ne peut pas s'agir de : %(values)s.

# form:feretui.form:FeretUIForm
source: This field cannot be edited
fr: Ce champ ne peut pas être édité

# form:feretui.form:FeretUIForm
source: This field is disabled and cannot have a value
fr: Ce champ est désactivé et ne peut pas avoir de valeur

# form:feretui.form:FeretUIForm
source: Not a valid time.
fr: Pas une heure valide.

# form:feretui.form:FeretUIForm
source: Not a valid decimal range value
fr: Il ne s'agit pas d'une valeur de plage décimale valide

# form:feretui.form:FeretUIForm
source: Not a valid float range value
fr: Il ne s'agit pas d'une valeur de plage flottante valide.

# form:feretui.form:FeretUIForm
source: Not a valid int range value
fr: Il ne s'agit pas d'une valeur de plage entière valide

# form:feretui.form:FeretUIForm
source: Not a valid date range value
fr: Il ne s'agit pas d'une valeur de plage de dates valide

# form:feretui.form:FeretUIForm
source: Not a valid datetime range value
fr: Il ne s'agit pas d'une valeur de plage date/heure valide

# form:feretui.form:FeretUIForm
source: Not a valid choice
fr: N'est pas un choix valide

# form:feretui.form:FeretUIForm
source: Not a valid color.
fr: Ce n'est pas une couleur valide.

# form:feretui.form:FeretUIForm
source: Invalid choice(s): one or more data inputs could not be coerced
fr: Choix invalide(s) : une ou plusieurs entrées de données n'ont pas pu être forcées.

# form:feretui.form:FeretUIForm
source: '%(value)s' is not a valid choice for this field
fr: '%(value)s' n'est pas un choix valide pour ce champ.

# form:feretui.form:FeretUIForm
source: Date must be greater than %(min)s.
fr: La date doit être supérieure à %(min)s.

# form:feretui.form:FeretUIForm
source: Date must be less than %(max)s.
fr: La date doit être inférieure à %(max)s.

# form:feretui.form:FeretUIForm
source: Date must be between %(min)s and %(max)s.
fr: La date doit être comprise entre %(min)s et %(max)s.

# form:feretui.form:FeretUIForm
source: Time must be greater than %(min)s.
fr: Le temps doit être supérieur à %(min)s.

# form:feretui.form:FeretUIForm
source: Time must be less than %(max)s.
fr: Le temps doit être inférieur à %(max)s.

# form:feretui.form:FeretUIForm
source: Time must be between %(min)s and %(max)s.
fr: Le temps doit être compris entre %(min)s et %(max)s.

# form:feretui.form:FeretUIForm
source: This field contains invalid JSON
fr: Ce champs contient un JSON invalide

# form:feretui.form:FeretUIForm
source: The password should have {msg}.
fr: Le mot de passe doit contenir {msg}.

# form:feretui.form:FeretUIForm
source: more than {min_size} caractere
fr: plus de {min_size} caractères

# form:feretui.form:FeretUIForm
source: less than {max_size} caractere
fr: moins de {max_size} caractères

# form:feretui.form:FeretUIForm
source: with lowercase
fr: avec des minuscules

# form:feretui.form:FeretUIForm
source: without lowercase
fr: sans minuscules

# form:feretui.form:FeretUIForm
source: with uppercase
fr: avec des majuscules

# form:feretui.form:FeretUIForm
source: without uppercase
fr: sans majuscules

# form:feretui.form:FeretUIForm
source: with letters
fr: avec des lettres

# form:feretui.form:FeretUIForm
source: without letters
fr: sans lettres

# form:feretui.form:FeretUIForm
source: with digits
fr: avec des chiffres

# form:feretui.form:FeretUIForm
source: without digits
fr: sans chiffres

# form:feretui.form:FeretUIForm
source: with symbols
fr: avec des caractères spéciaux

# form:feretui.form:FeretUIForm
source: without symbols
fr: sans caractères spéciaux

# form:feretui.form:FeretUIForm
source: with spaces
fr: avec des espaces

# form:feretui.form:FeretUIForm
source: without spaces
fr: sans espaces

# template:feretui-client-header:a:data-tooltip
source: Go to the homepage
fr: Aller à la page d'accueil

# template:feretui-client-header
source: Log out
fr: Se déconnecter

# template:feretui-client-footer
source: by Js Suzanne.
fr: par Jean-Sébastien Suzanne.

# template:feretui-page-404
source: Page not found
fr: Page non trouvée

# template:feretui-page-404
source: The page "
fr: La page "

# template:feretui-page-404
source: " is not a declared page
fr: " n'est pas déclarée

# template:feretui-page-forbidden
source: This page is forbidden
fr: Cette page n'est pas autorisée

# template:feretui-page-forbidden
source: The page "
fr: La page "

# template:feretui-page-forbidden
source: " is forbidden.
fr: " n'est pas autorisée.

# template:feretui-page-homepage
source: Welcome to the FeretUI's client
fr: Bienvenue sur le client FeretUI

# template:feretui-page-homepage
source: Small and modular web client to administrate your service
fr: Petit client web pour administrer votre service

# template:feretui-page-login
source: Log in
fr: Se connecter

# template:feretui-page-signup
source: Register a new user
fr: Enregistrer un nouveau utilisateur

# template:feretui-page-signup
source: Sign up
fr: Enregistrer

# template:feretui-input-label
source: required
fr: requis

# template:view-delete-form
source: Do you wanted delete its ?
fr: Voulez vous supprimer les entrées?

# template:view-goto-create-button
source: Create
fr: Créer

# template:view-do-save-button
source: Save
fr: Sauvegarder

# template:view-goto-selected-delete-button
source: Delete
fr: Supprimer

# template:view-goto-delete-button
source: Delete
fr: Supprimer

# template:view-do-delete-button
source: Delete
fr: Supprimer

# template:view-goto-edit-button
source: Edit
fr: Modifier

# template:view-goto-return-button
source: Return
fr: Retour

# template:view-goto-cancel-button
source: Cancel
fr: Annuler

# template:view-goto-edit-cancel-button
source: Cancel
fr: Annuler

# template:view-filter
source: Filter
fr: Filtrer

# form:feretui.session:LoginForm:field:login:label
source: Login
fr: Identifiant

# form:feretui.session:LoginForm:field:password:label
source: Password
fr: Mot de passe

# form:feretui.session:SignUpForm:field:lang:label
source: Language
fr: Langue

# form:feretui.session:SignUpForm:field:login:label
source: Login
fr: Identifiant

# form:feretui.session:SignUpForm:field:password:label
source: Password
fr: Mot de passe

# form:feretui.session:SignUpForm:field:password_confirm:label
source: Password Confirm
fr: Confirmer le mot de passe
